SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Bootloader/Device/MM32F5370/Include/reg_spi.h
/**
  * @brief SPI_GCTL Register Bit Definition
  */
#define  SPI_GCTL_SPIEN_Pos                       (0)
#define  SPI_GCTL_SPIEN_Msk                       (0x1U << SPI_GCTL_SPIEN_Pos)                      /*!<SPI/I2S selection bit*/
#define  SPI_GCTL_SPIEN                           SPI_GCTL_SPIEN_Msk
#define  SPI_GCTL_INTEN_Pos                       (1)
#define  SPI_GCTL_INTEN_Msk                       (0x1U << SPI_GCTL_INTEN_Pos)                      /*!<SPI/I2S interrupt enable bit*/
#define  SPI_GCTL_INTEN                           SPI_GCTL_INTEN_Msk
#define  SPI_GCTL_MODE_Pos                        (2)
#define  SPI_GCTL_MODE_Msk                        (0x1U << SPI_GCTL_MODE_Pos)                       /*!<Host mode bit*/
#define  SPI_GCTL_MODE                            SPI_GCTL_MODE_Msk
#define  SPI_GCTL_TXEN_Pos                        (3)
#define  SPI_GCTL_TXEN_Msk                        (0x1U << SPI_GCTL_TXEN_Pos)                       /*!<Transmission enable bit*/
#define  SPI_GCTL_TXEN                            SPI_GCTL_TXEN_Msk
#define  SPI_GCTL_RXEN_Pos                        (4)
#define  SPI_GCTL_RXEN_Msk                        (0x1U << SPI_GCTL_RXEN_Pos)                       /*!<Receipt enable bit*/
#define  SPI_GCTL_RXEN                            SPI_GCTL_RXEN_Msk
#define  SPI_GCTL_DMAMODE_Pos                     (9)
#define  SPI_GCTL_DMAMODE_Msk                     (0x1U << SPI_GCTL_DMAMODE_Pos)                    /*!<DMA mode selection bit*/
#define  SPI_GCTL_DMAMODE                         SPI_GCTL_DMAMODE_Msk
#define  SPI_GCTL_NSS_Pos                         (10)
#define  SPI_GCTL_NSS_Msk                         (0x1U << SPI_GCTL_NSS_Pos)                        /*!<NSS output in the hardware or software control master mode*/
#define  SPI_GCTL_NSS                             SPI_GCTL_NSS_Msk
#define  SPI_GCTL_DW8_32_Pos                      (11)
#define  SPI_GCTL_DW8_32_Msk                      (0x1U << SPI_GCTL_DW8_32_Pos)                     /*!<Transmission and receipt data register valid data selection*/
#define  SPI_GCTL_DW8_32                          SPI_GCTL_DW8_32_Msk
#define  SPI_GCTL_PAD_SEL_Pos                     (13)
#define  SPI_GCTL_PAD_SEL_Msk                     (0x1FU << SPI_GCTL_PAD_SEL_Pos)                   /*!<PAD0,PAD1,PAD2,PAD3 respectively correspond to SCK, MOSI, NSS and MISO pins of pins. Mapping change of signal SCL, MOSI, NSS, MISO and PAD:PAD_SEL SCL MOSI NSS MISO*/
#define  SPI_GCTL_PAD_SEL                         SPI_GCTL_PAD_SEL_Msk
#define  SPI_GCTL_PAD_SEL_Bit0                    (0x01U << SPI_GCTL_PAD_SEL_Pos) 
#define  SPI_GCTL_PAD_SEL_Bit1                    (0x02U << SPI_GCTL_PAD_SEL_Pos) 
#define  SPI_GCTL_PAD_SEL_Bit2                    (0x04U << SPI_GCTL_PAD_SEL_Pos) 
#define  SPI_GCTL_PAD_SEL_Bit3                    (0x08U << SPI_GCTL_PAD_SEL_Pos) 
#define  SPI_GCTL_PAD_SEL_Bit4                    (0x10U << SPI_GCTL_PAD_SEL_Pos) 

/**
  * @brief SPI_CCTL Register Bit Definition
  */
#define  SPI_CCTL_CPHA_Pos                        (0)
#define  SPI_CCTL_CPHA_Msk                        (0x1U << SPI_CCTL_CPHA_Pos)                       /*!<Clock phase selection bit*/
#define  SPI_CCTL_CPHA                            SPI_CCTL_CPHA_Msk
#define  SPI_CCTL_CPOL_Pos                        (1)
#define  SPI_CCTL_CPOL_Msk                        (0x1U << SPI_CCTL_CPOL_Pos)                       /*!<Clock polarity flag bit*/
#define  SPI_CCTL_CPOL                            SPI_CCTL_CPOL_Msk
#define  SPI_CCTL_LSBFE_Pos                       (2)
#define  SPI_CCTL_LSBFE_Msk                       (0x1U << SPI_CCTL_LSBFE_Pos)                      /*!<LSBFE:LSB front enable bit*/
#define  SPI_CCTL_LSBFE                           SPI_CCTL_LSBFE_Msk
#define  SPI_CCTL_SPILEN_Pos                      (3)
#define  SPI_CCTL_SPILEN_Msk                      (0x1U << SPI_CCTL_SPILEN_Pos)                     /*!<SPI data width bit This bit works after DW8_32 setting (DW8_32 =0); this bit should be kept as 1 during DW8_32=1.*/
#define  SPI_CCTL_SPILEN                          SPI_CCTL_SPILEN_Msk
#define  SPI_CCTL_RXEDGE_Pos                      (4)
#define  SPI_CCTL_RXEDGE_Msk                      (0x1U << SPI_CCTL_RXEDGE_Pos)                     /*!<Receipt data sampling clock edge selection bit (master mode)*/
#define  SPI_CCTL_RXEDGE                          SPI_CCTL_RXEDGE_Msk
#define  SPI_CCTL_TXEDGE_Pos                      (5)
#define  SPI_CCTL_TXEDGE_Msk                      (0x1U << SPI_CCTL_TXEDGE_Pos)                     /*!<Transmission data phase bit adjustment (slave mode)*/
#define  SPI_CCTL_TXEDGE                          SPI_CCTL_TXEDGE_Msk
#define  SPI_CCTL_CPHASEL_Pos                     (6)
#define  SPI_CCTL_CPHASEL_Msk                     (0x1U << SPI_CCTL_CPHASEL_Pos)                    /*!<CPHA polarity inversion selection*/
#define  SPI_CCTL_CPHASEL                         SPI_CCTL_CPHASEL_Msk
#define  SPI_CCTL_TISEL_Pos                       (7)
#define  SPI_CCTL_TISEL_Msk                       (0x1U << SPI_CCTL_TISEL_Pos)                      /*!<*/
#define  SPI_CCTL_TISEL                           SPI_CCTL_TISEL_Msk
#define  SPI_CCTL_MRDECHG_Pos                     (8)
#define  SPI_CCTL_MRDECHG_Msk                     (0x7U << SPI_CCTL_MRDECHG_Pos)                    /*!<*/
#define  SPI_CCTL_MRDECHG                         SPI_CCTL_MRDECHG_Msk
#define  SPI_CCTL_MRDECHG_Bit0                    (0x1U << SPI_CCTL_MRDECHG_Pos) 
#define  SPI_CCTL_MRDECHG_Bit1                    (0x2U << SPI_CCTL_MRDECHG_Pos) 
#define  SPI_CCTL_MRDECHG_Bit2                    (0x4U << SPI_CCTL_MRDECHG_Pos) 

/**
  * @brief SPI_SPBRG Register Bit Definition
  */
#define  SPI_SPBRG_SPBRG_Pos                      (0)
#define  SPI_SPBRG_SPBRG_Msk                      (0xFFFFU << SPI_SPBRG_SPBRG_Pos)                  /*!<SPI baud rate control register for baud rate Baud rate formula: Baud rate = Fpclk/SPBRG (Fpclk is APB clock frequency) Note: Don't write 0 and 1 in the register.*/
#define  SPI_SPBRG_SPBRG                          SPI_SPBRG_SPBRG_Msk
#define  SPI_SPBRG_SPBRG_Bit0                     (0x0001U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_Bit1                     (0x0002U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_Bit2                     (0x0004U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_Bit3                     (0x0008U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_Bit4                     (0x0010U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_Bit5                     (0x0020U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_Bit6                     (0x0040U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_Bit7                     (0x0080U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_Bit8                     (0x0100U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_Bit9                     (0x0200U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_Bit10                    (0x0400U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_Bit11                    (0x0800U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_Bit12                    (0x1000U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_Bit13                    (0x2000U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_Bit14                    (0x4000U << SPI_SPBRG_SPBRG_Pos) 
#define  SPI_SPBRG_SPBRG_Bit15                    (0x8000U << SPI_SPBRG_SPBRG_Pos) 

/**
  * @brief SPI_RXDNR Register Bit Definition
  */
#define  SPI_RXDNR_RXDNR_Pos                      (0)
#define  SPI_RXDNR_RXDNR_Msk                      (0xFFFFU << SPI_RXDNR_RXDNR_Pos)                  /*!<The register is used to hold a count of to be received in the next receipt process Note: The register value is valid when SPI is in the host receipt mode. The default value is 1. The register value changes by MCU write value, and don't write the '0' value in the register.*/
#define  SPI_RXDNR_RXDNR                          SPI_RXDNR_RXDNR_Msk
#define  SPI_RXDNR_RXDNR_Bit0                     (0x0001U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_Bit1                     (0x0002U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_Bit2                     (0x0004U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_Bit3                     (0x0008U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_Bit4                     (0x0010U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_Bit5                     (0x0020U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_Bit6                     (0x0040U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_Bit7                     (0x0080U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_Bit8                     (0x0100U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_Bit9                     (0x0200U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_Bit10                    (0x0400U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_Bit11                    (0x0800U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_Bit12                    (0x1000U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_Bit13                    (0x2000U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_Bit14                    (0x4000U << SPI_RXDNR_RXDNR_Pos) 
#define  SPI_RXDNR_RXDNR_Bit15                    (0x8000U << SPI_RXDNR_RXDNR_Pos) 

/**
  * @brief SPI_NSSR Register Bit Definition
  */
#define  SPI_NSSR_NSS_Pos                         (0)
#define  SPI_NSSR_NSS_Msk                         (0x1U << SPI_NSSR_NSS_Pos)                        /*!<The chip selection output signal in the master mode. Low valid, the bit is invalid in the slave mode*/
#define  SPI_NSSR_NSS                             SPI_NSSR_NSS_Msk

/**
  * @brief SPI_EXTCTL Register Bit Definition
  */
#define  SPI_EXTCTL_EXTLEN_Pos                    (0)
#define  SPI_EXTCTL_EXTLEN_Msk                    (0x1FU << SPI_EXTCTL_EXTLEN_Pos)                  /*!<Control SPI data length*/
#define  SPI_EXTCTL_EXTLEN                        SPI_EXTCTL_EXTLEN_Msk
#define  SPI_EXTCTL_EXTLEN_Bit0                   (0x01U << SPI_EXTCTL_EXTLEN_Pos) 
#define  SPI_EXTCTL_EXTLEN_Bit1                   (0x02U << SPI_EXTCTL_EXTLEN_Pos) 
#define  SPI_EXTCTL_EXTLEN_Bit2                   (0x04U << SPI_EXTCTL_EXTLEN_Pos) 
#define  SPI_EXTCTL_EXTLEN_Bit3                   (0x08U << SPI_EXTCTL_EXTLEN_Pos) 
#define  SPI_EXTCTL_EXTLEN_Bit4                   (0x10U << SPI_EXTCTL_EXTLEN_Pos) 

/**
  * @brief SPI_I2SCFGR Register Bit Definition
  */
#define  SPI_I2SCFGR_CHLEN_Pos                    (0)
#define  SPI_I2SCFGR_CHLEN_Msk                    (0x1U << SPI_I2SCFGR_CHLEN_Pos)                   /*!<Audio length (data bit number contained in each audio)*/
#define  SPI_I2SCFGR_CHLEN                        SPI_I2SCFGR_CHLEN_Msk
#define  SPI_I2SCFGR_DATLEN_Pos                   (1)
#define  SPI_I2SCFGR_DATLEN_Msk                   (0x3U << SPI_I2SCFGR_DATLEN_Pos)                  /*!<Data length*/
#define  SPI_I2SCFGR_DATLEN                       SPI_I2SCFGR_DATLEN_Msk
#define  SPI_I2SCFGR_DATLEN_Bit0                  (0x1U << SPI_I2SCFGR_DATLEN_Pos) 
#define  SPI_I2SCFGR_DATLEN_Bit1                  (0x2U << SPI_I2SCFGR_DATLEN_Pos) 
#define  SPI_I2SCFGR_I2SSTD_Pos                   (4)
#define  SPI_I2SCFGR_I2SSTD_Msk                   (0x3U << SPI_I2SCFGR_I2SSTD_Pos)                  /*!<I2S standard*/
#define  SPI_I2SCFGR_I2SSTD                       SPI_I2SCFGR_I2SSTD_Msk
#define  SPI_I2SCFGR_I2SSTD_Bit0                  (0x1U << SPI_I2SCFGR_I2SSTD_Pos) 
#define  SPI_I2SCFGR_I2SSTD_Bit1                  (0x2U << SPI_I2SCFGR_I2SSTD_Pos) 
#define  SPI_I2SCFGR_PCMSYNC_Pos                  (6)
#define  SPI_I2SCFGR_PCMSYNC_Msk                  (0x1U << SPI_I2SCFGR_PCMSYNC_Pos)                 /*!<PCM standard frame sync mode*/
#define  SPI_I2SCFGR_PCMSYNC                      SPI_I2SCFGR_PCMSYNC_Msk
#define  SPI_I2SCFGR_SPI_I2S_Pos                  (10)
#define  SPI_I2SCFGR_SPI_I2S_Msk                  (0x1U << SPI_I2SCFGR_SPI_I2S_Pos)                 /*!<Module function selection*/
#define  SPI_I2SCFGR_SPI_I2S                      SPI_I2SCFGR_SPI_I2S_Msk
#define  SPI_I2SCFGR_MCKOE_Pos                    (11)
#define  SPI_I2SCFGR_MCKOE_Msk                    (0x1U << SPI_I2SCFGR_MCKOE_Pos)                   /*!<MCK clock output enable*/
#define  SPI_I2SCFGR_MCKOE                        SPI_I2SCFGR_MCKOE_Msk
#define  SPI_I2SCFGR_MCKSEL_Pos                   (12)
#define  SPI_I2SCFGR_MCKSEL_Msk                   (0x1U << SPI_I2SCFGR_MCKSEL_Pos)                  /*!<*/
#define  SPI_I2SCFGR_MCKSEL                       SPI_I2SCFGR_MCKSEL_Msk
#define  SPI_I2SCFGR_HDSEL_Pos                    (13)
#define  SPI_I2SCFGR_HDSEL_Msk                    (0x1U << SPI_I2SCFGR_HDSEL_Pos)                   /*!<*/
#define  SPI_I2SCFGR_HDSEL                        SPI_I2SCFGR_HDSEL_Msk
#define  SPI_I2SCFGR_I2SDIV_Pos                   (16)
#define  SPI_I2SCFGR_I2SDIV_Msk                   (0x1FFU << SPI_I2SCFGR_I2SDIV_Pos)                /*!<I2S prescaler division factor*/
#define  SPI_I2SCFGR_I2SDIV                       SPI_I2SCFGR_I2SDIV_Msk
#define  SPI_I2SCFGR_I2SDIV_Bit0                  (0x001U << SPI_I2SCFGR_I2SDIV_Pos) 
#define  SPI_I2SCFGR_I2SDIV_Bit1                  (0x002U << SPI_I2SCFGR_I2SDIV_Pos) 
#define  SPI_I2SCFGR_I2SDIV_Bit2                  (0x004U << SPI_I2SCFGR_I2SDIV_Pos) 
#define  SPI_I2SCFGR_I2SDIV_Bit3                  (0x008U << SPI_I2SCFGR_I2SDIV_Pos) 
#define  SPI_I2SCFGR_I2SDIV_Bit4                  (0x010U << SPI_I2SCFGR_I2SDIV_Pos) 
#define  SPI_I2SCFGR_I2SDIV_Bit5                  (0x020U << SPI_I2SCFGR_I2SDIV_Pos) 
#define  SPI_I2SCFGR_I2SDIV_Bit6                  (0x040U << SPI_I2SCFGR_I2SDIV_Pos) 
#define  SPI_I2SCFGR_I2SDIV_Bit7                  (0x080U << SPI_I2SCFGR_I2SDIV_Pos) 
#define  SPI_I2SCFGR_I2SDIV_Bit8                  (0x100U << SPI_I2SCFGR_I2SDIV_Pos) 


#endif

